; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v6 - type_2 ?v1 - type_3)
 	      (pred_3 ?v4 - object ?v1 - type_3)
	      (pred_1 ?v6 - type_2 ?v8 - type_1)
	      (pred_4 ?v6 - type_2 ?v4 - object ?v8 - type_1))

   (:action op_1
       :parameters  (?v6 - type_2 ?v7 ?v2 - type_3)
       :precondition (and  (pred_2 ?v6 ?v7))
       :effect (and  (pred_2 ?v6 ?v2)
		     (not (pred_2 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_2 ?v5 - object ?v3 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v3) (pred_2 ?v6 ?v3) (pred_1 ?v6 ?v8))
       :effect (and (pred_4 ?v6 ?v5 ?v8)
		    (not (pred_3 ?v5 ?v3)) 
		    (not (pred_1 ?v6 ?v8))))

   (:action op_3
       :parameters (?v6 - type_2 ?v5 - object ?v3 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v5 ?v8) (pred_2 ?v6 ?v3))
       :effect (and (pred_3 ?v5 ?v3)
		    (pred_1 ?v6 ?v8)
		    (not (pred_4 ?v6 ?v5 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_02 - type_2
obj_09 obj_07 obj_12 obj_04 - type_1
obj_10 obj_03 obj_06 - type_3
obj_01 obj_11 obj_08 - object)
(:init
(pred_2 obj_05 obj_03)
(pred_1 obj_05 obj_09)
(pred_1 obj_05 obj_07)
(pred_2 obj_02 obj_10)
(pred_1 obj_02 obj_12)
(pred_1 obj_02 obj_04)
(pred_3 obj_01 obj_06)
(pred_3 obj_11 obj_03)
(pred_3 obj_08 obj_06)
)
(:goal
(and
(pred_3 obj_01 obj_03)
(pred_3 obj_11 obj_03)
(pred_3 obj_08 obj_06)
)
)

(:constraints
  (always (not (pred_2 obj_05 obj_06)))
)
)

; plan
1. (op_1 obj_02 obj_10 obj_06)
   deleted: (pred_2 obj_02 obj_10)
   added: (pred_2 obj_02 obj_06)
   goals met: 2 of 3
2. (op_2 obj_02 obj_01 obj_06 obj_04)
   deleted: (pred_3 obj_01 obj_06) (pred_1 obj_02 obj_04)
   added: (pred_4 obj_02 obj_01 obj_04)
   goals met: 2 of 3
3. (op_1 obj_02 obj_06 obj_03)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_03)
   goals met: 2 of 3
4. (op_3 obj_02 obj_01 obj_03 obj_04)
   deleted: (pred_4 obj_02 obj_01 obj_04)
   added: (pred_3 obj_01 obj_03) (pred_1 obj_02 obj_04)
   goals met: 3 of 3
